app/Controllers/Home.php

    public function index()
    {
        $model = new UserModel();
        if ($this->request->is('post')) {
            $user = $this->request->getPost();
            $model->save($user);
        }
        $allUsers = $model->findAll();
---
INSERT INTO `tb_users` (`first_name`, `last_name`) VALUES ('dsadas', 'asdsad')
SELECT *
FROM `tb_users`

    public function updateUser($id){
        $model = new UserModel();
        $user = $model->find($id);
        $allUsers = $model->findAll();
---
SELECT *
FROM `tb_users`
WHERE `tb_users`.`id` = '34'
SELECT *
FROM `tb_users`

    public function deleteUser($id){
        $model = new UserModel();
        $model->delete($id);
---
DELETE FROM `tb_users`
WHERE `id` IN ('44')